examples/openfoam_airfoil/airfoil_tuner_template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "1402";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14336
(
(50.6874 0 9.02538)
(50.6856 0 9.024)
(50.6851 0 9.02193)
(50.6844 0 9.01882)
(50.6841 0 9.01473)
(50.6838 0 9.0095)
(50.6836 0 9.00292)
(50.6836 0 8.99471)
...
)
;

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (50.6805 0 9.04583);
        value           nonuniform List<vector> 
224
(
(50.6843 0 9.04191)
(50.6831 0 9.0413)
(50.6826 1.85426e-20 9.04119)
(50.6822 -4.60657e-21 9.0412)
(50.6819 8.00682e-19 9.0413)
(50.6816 -2.46318e-18 9.04145)
(50.6815 1.81634e-18 9.04162)
(50.6813 -1.89981e-18 9.04179)
...
)
;
    }
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (50.6805 0 9.04583);
        value           nonuniform List<vector> 
128
(
(50.6874 0 9.02554)
(50.6874 -2.14659e-33 9.02554)
(50.6874 0 9.02554)
(50.6874 2.62913e-33 9.02554)
(50.6874 5.50121e-32 9.02554)
(50.6874 -5.53408e-32 9.02554)
(50.6874 -7.21812e-32 9.02554)
(50.6874 7.26311e-32 9.02554)
...
)
;
    }
    airfoil
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
