examples/openfoam_airfoil/airfoil_tuner_template/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
14336
(
(453.135 -0.5 -1.75636e-06)
(366.57 -0.5 -1.75636e-06)
(296.578 -0.5 -1.75636e-06)
(239.986 -0.5 -1.75637e-06)
(194.228 -0.5 -1.75637e-06)
(157.231 -0.5 -1.75638e-06)
(127.317 -0.5 -1.75638e-06)
(103.13 -0.5 -1.75639e-06)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
224
(
(453.312 -0.5 -493.568)
(367.09 -0.5 -493.726)
(297.77 -0.5 -494.105)
(243.131 -0.5 -494.954)
(201.764 -0.5 -496.425)
(172.026 -0.5 -498.272)
(151.478 -0.5 -500.05)
(137.459 -0.5 -501.495)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(501 -0.5 -1.75636e-06)
(501 -0.5 1.8634e-06)
(501 -0.5 -5.94819e-06)
(501 -0.5 6.05523e-06)
(501 -0.5 -1.1465e-05)
(501 -0.5 1.1572e-05)
(501 -0.5 -1.87256e-05)
(501 -0.5 1.88326e-05)
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.997891 -0.5 -0.000298368)
(0.993353 -0.5 -0.000938539)
(0.988131 -0.5 -0.00167079)
(0.982129 -0.5 -0.00250637)
(0.975244 -0.5 -0.00345726)
(0.967362 -0.5 -0.00453603)
(0.958359 -0.5 -0.00575558)
(0.9481 -0.5 -0.00712883)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
