examples/openfoam_airfoil/airfoil_tuner_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    //div(phi,U)      bounded Gauss linearUpwind grad(U);
    
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    //div(phi,k)      Gauss linearUpwind grad(omega); 
	//div(phi,omega)	Gauss linearUpwind grad(omega);
	
	/*
	div(phi,U)      Gauss linear;
    div(phi,k)      Gauss limitedLinear 1; 
	div(phi,omega)	Gauss limitedLinear 1;
	*/
	//Gauss limitedLinear 1
    
    div(phi,k)      Gauss upwind; 
	div(phi,omega)	Gauss upwind;
	
	
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
