examples/openfoam_airfoil/airfoil_tuner_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.1;
        smoother        GaussSeidel;
    }
    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    /*
    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }
    */
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
	consistent 			yes;
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(U|k|epsilon|omega|nuTilda|phit)"         1e-6;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        "(k|epsilon|omega|nuTilda|phit|f)" 0.7;
    }
}


// ************************************************************************* //
